app/Controllers/CustomerController.php

    public function index()
    {
        $data = [
            'title'     => 'Customer Management',
            'customers' => $this->customerModel->findAll()
---
SELECT *
FROM `customers`