app/Controllers/Dashboard.php

    public function index()
    {
        $productModel = new ProductModel();
        $customerModel = new CustomerModel();
        $userModel = new UserModel();

        $data = [
            'products'  => $productModel->findAll(),
            'customers' => $customerModel->findAll(),
            'users'     => $userModel->findAll(),
        ];
---
SELECT *
FROM `products`
SELECT *
FROM `customers`
SELECT *
FROM `users`