app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $data = [
            'title'    => 'Product Management',
            'products' => $this->productModel->findAll()