app/Controllers/SalesController.php

    public function create()
    {
        $data = [
            'title'     => 'Record Sale',
            'products'  => $this->productModel->findAll(),
            'customers' => $this->customerModel->findAll()
---
SELECT *
FROM `products`
SELECT *
FROM `customers`