app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data = [
            'title' => 'Staff Management',
            'users' => $this->userModel->findAll()