app/Models/SaleModel.php

SELECT `sales`.*, `products`.`name` as `product_name`, `customers`.`full_name` as `customer_name`, `users`.`full_name` as `staff_name`
FROM `sales`
JOIN `products` ON `products`.`id` = `sales`.`product_id`
LEFT JOIN `customers` ON `customers`.`id` = `sales`.`customer_id`
JOIN `users` ON `users`.`id` = `sales`.`sold_by`
ORDER BY `sales`.`created_at` DESC
---
    public function getSalesWithDetails()
    {
        return $this->select('sales.*, products.name as product_name, customers.full_name as customer_name, users.full_name as staff_name')
                    ->join('products', 'products.id = sales.product_id')
                    ->join('customers', 'customers.id = sales.customer_id', 'left')
                    ->join('users', 'users.id = sales.sold_by')
                    ->orderBy('sales.created_at', 'DESC')
                    ->findAll();